# Gruppierungen
* transform bläht die Gruppierung wieder zur Original Shape auf, siehe eigenes Dokument transform
* unstack entpivotisiert eine Gruppierung und macht Spalten zu Zeilen >> eigenes Thema

In [1]:
# blab init
import blab
startup_notebook = blab.blab_startup()
%run $startup_notebook

JupyterLab Tools Version 0.21
found local libs at /Data_lab/libs
Start Time: 07:54:28

time: 246 ms (started: 2022-06-23 07:54:28 +00:00)

In [2]:
import numpy      as np
import pandas     as pd 
import bpyth      as bpy
import pandasklar as pak 

grid = pak.grid

time: 1.39 s (started: 2022-06-23 07:54:28 +00:00)

In [3]:
# Beispieldaten erzeugen
np.random.seed(100)
df = pak.leute(100).sort_values(['alter','vorname'])
df = pak.move_cols(df,['alter','vorname'], 'altersklasse')
grid(df)

100 Datensätze

time: 174 ms (started: 2022-06-23 07:54:29 +00:00)

## Basics

In [4]:
# grouped-Objekt erzeugen
grouped_altersklasse = df.groupby('altersklasse')

time: 902 µs (started: 2022-06-23 07:54:30 +00:00)

In [5]:
# Gruppen anzeigen
grouped_altersklasse.groups

{20: [33, 23, 60, 70, 87, 24, 21, 7, 26, 90, 29, 19, 51, 12, 75, 22, 57, 92, 73, 79, 32, 64, 81, 53, 8, 41, 97, 5, 27, 76, 85, 98, 40], 30: [6, 88, 18, 39, 31, 80, 43, 52, 44, 59, 78, 13, 9, 54, 72, 20, 83, 0, 2, 71, 94, 66, 56, 3, 55, 96, 30, 84, 77, 16, 28, 35, 47, 1, 4, 36, 14, 37, 42, 95, 49, 25, 34, 93, 45, 48, 58, 63, 11, 82, 62, 10, 15, 65, 61, 99, 38, 89, 86, 91, 68], 40: [46, 67, 69, 74, 17, 50]}

time: 3.35 ms (started: 2022-06-23 07:54:30 +00:00)

In [6]:
# Gruppen iterieren
for name, group in grouped_altersklasse:
    print(name, len(group))

20 33
30 61
40 6
time: 10.9 ms (started: 2022-06-23 07:54:30 +00:00)

In [7]:
# Einzelne Gruppe selektieren
# wirkt wie eine Maske
grouped_altersklasse.get_group(20)

,altersklasse,alter,vorname,plz,geburtsstadt,passwort,merkmale,history
33,20,20,Luise,12349,Bremen,sueZtu9,"{1, K, Z, t}","[A, x]"
23,20,21,Bettina,65173,Bremen,h2gmXdlR,{E},"[c, b, a]"
60,20,22,Detlef,20558,Bremen,InPggz4e,"{i, 0, t}",[]
70,20,22,Helga,17664,Berlin,ÖsVtbINx,"{N, y, 4, G}","[b, b, a, b]"
87,20,22,Helga,36893,<NA>,MRLN8geZJq,"{b, a, 5, g, K}","[A, B, C]"
24,20,23,Tim,77954,Berlin,kG5zRh,"{D, P, 1, m}","[A, A, A]"
21,20,24,Claudia,66954,Bremen,B2aFS8FW,"{n, t}","[A, x]"
7,20,24,Nikolas,29367,Berlin,DqoÜä4AXh,"{n, T, c, h}","[a, b, c]"
26,20,25,Christel,57493,Bremen,aku2ON3,{N},"[A, B, C]"
90,20,25,Ingrid,62684,Bremen,üOIMi,"{W, f, t}","[c, b, a]"
29,20,25,Nicole,60857,Bremen,qkQÄ6H,"{Y, 5, 0, m}","[A, B, C, C]"
19,20,25,Tobias,17823,Bremen,ÜöTaav,"{l, g}","[A, x]"
51,20,26,Raphael,98049,Bremen,q8uQawWHN,"{2, 5, 4}","[c, b, a]"
12,20,26,Till,86927,Berlin,PUWgG,"{z, G}","[A, A, A]"
75,20,26,Till,59432,Bremen,fx9hRE,"{c, f}","[c, b, a]"
22,20,27,Alexander,40404,Berlin,HKntZQ,"{v, T, 2, p, X}","[A, C, C, B]"
57,20,27,Helga,93811,Bremen,ACGeDy1,"{F, G, n, S, y}","[A, C, C, B]"
92,20,27,Ingrid,85024,<NA>,dlYbGuYNj,"{E, l}",[]
73,20,27,Lilly,93811,Bremen,hjläxGuLk,"{H, g}","[A, A, A]"
79,20,27,Maurice,98049,<NA>,UYLjV4f,"{U, X, l, S}","[A, A, A]"
32,20,27,Niklas,51121,<NA>,P5xd1XyWP,"{E, l, m}","[A, C, C, B]"
64,20,27,Yannic,<NA>,Bremen,51PReoha,"{V, y}","[b, b, a, b]"
81,20,28,Alexander,36514,<NA>,OHXySJX6äo,{x},"[A, B, C]"
53,20,28,Christa,99904,Berlin,guaQTIaJ,"{Z, h, d, t}",[]
8,20,28,Fiona,91514,Berlin,2zzV8jlNsk,{M},"[A, A, A]"
41,20,28,Katja,60214,Berlin,vo6UOy3,"{o, t}","[A, A, A]"
97,20,28,Michelle,<NA>,Bremen,culHkbFU,"{r, B}","[A, C, C, B]"
5,20,28,Tom,88095,Bremen,pKvüEPW3Hb,"{P, p, t}","[c, b, a]"
27,20,29,Ingeborg,64075,Berlin,qEf2bAs,"{A, q}","[A, x]"
76,20,29,Steffen,36514,Bremen,6LpIq,{g},"[A, A, A]"
85,20,29,Till,56043,Berlin,ÜD24ü,{N},"[A, A, A]"
98,20,29,Tim,57987,Bremen,9bOÖDpp,{J},"[b, b, a, b]"
40,20,29,Torsten,72637,Berlin,öxÜüü,"{Z, t, P, L, S}","[b, b, a, b]"

time: 34.6 ms (started: 2022-06-23 07:54:30 +00:00)

## Aggregatfunktionen
Liste von Aggregatfunktionen: https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/

In [8]:
s = grouped_altersklasse['alter'].apply(list)
s

altersklasse
20    [20, 21, 22, 22, 22, 23, 24, 24, 25, 25, 25, 2...
30    [30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 31, 3...
40                             [40, 41, 41, 41, 41, 42]
Name: alter, dtype: object

time: 4.59 ms (started: 2022-06-23 07:54:30 +00:00)

### Mittelwert

In [9]:
grouped_altersklasse.mean()

                  alter           plz
altersklasse
20                 26.0  61157.870968
30            34.163934  59802.818182
40                 41.0  76354.833333

time: 59.4 ms (started: 2022-06-23 07:54:30 +00:00)

In [10]:
grouped_altersklasse['alter'].mean()

altersklasse
20         26.0
30    34.163934
40         41.0
Name: alter, dtype: Float64

time: 2.77 ms (started: 2022-06-23 07:54:30 +00:00)

### Häufigkeiten

* https://stackoverflow.com/questions/22391433/count-the-frequency-that-a-value-occurs-in-a-dataframe-column

In [11]:
grouped_altersklasse['alter'].count()

altersklasse
20    33
30    61
40     6
Name: alter, dtype: int64

time: 2.66 ms (started: 2022-06-23 07:54:30 +00:00)

In [12]:
grid(df)

100 Datensätze

time: 32.6 ms (started: 2022-06-23 07:54:30 +00:00)

In [13]:
df.groupby(['alter']).count() # siehe auch size()

       altersklasse  vorname  plz  geburtsstadt  passwort  merkmale  history
alter
20                1        1    1             1         1         1        1
21                1        1    1             1         1         1        1
22                3        3    3             2         3         3        3
23                1        1    1             1         1         1        1
24                2        2    2             2         2         2        2
25                4        4    4             4         4         4        4
26                3        3    3             3         3         3        3
27                7        7    6             4         7         7        7
28                6        6    5             5         6         6        6
29                5        5    5             5         5         5        5
30               10       10   10             8        10        10       10
31                3        3    3             2         3         3        3
32                8        8    6             5         8         8        8
33                5        5    5             5         5         5        5
34                6        6    5             6         6         6        6
35                8        8    6             7         8         8        8
36                3        3    3             1         3         3        3
37               10       10    9             9        10        10       10
38                4        4    4             0         4         4        4
39                4        4    4             1         4         4        4
40                1        1    1             1         1         1        1
41                4        4    4             4         4         4        4
42                1        1    1             0         1         1        1

time: 8.48 ms (started: 2022-06-23 07:54:30 +00:00)

In [14]:
df.groupby(['alter','plz'], as_index=False).count() # siehe auch size()

,alter,plz,altersklasse,vorname,geburtsstadt,passwort,merkmale,history
0,20,12349,1,1,1,1,1,1
1,21,65173,1,1,1,1,1,1
2,22,17664,1,1,1,1,1,1
3,22,20558,1,1,1,1,1,1
4,22,36893,1,1,0,1,1,1
...,...,...,...,...,...,...,...,...
86,41,46514,1,1,1,1,1,1
87,41,57346,1,1,1,1,1,1
88,41,85024,1,1,1,1,1,1
89,41,88487,1,1,1,1,1,1
90,42,98053,1,1,0,1,1,1

time: 10.7 ms (started: 2022-06-23 07:54:30 +00:00)

In [15]:
df.groupby(['alter','plz']).size()

alter  plz
20     12349    1
21     65173    1
22     17664    1
       20558    1
       36893    1
               ..
41     46514    1
       57346    1
       85024    1
       88487    1
42     98053    1
Length: 91, dtype: int64

time: 6.29 ms (started: 2022-06-23 07:54:30 +00:00)

In [16]:
a = df.groupby(['alter','plz']).size()
a

alter  plz
20     12349    1
21     65173    1
22     17664    1
       20558    1
       36893    1
               ..
41     46514    1
       57346    1
       85024    1
       88487    1
42     98053    1
Length: 91, dtype: int64

time: 5.33 ms (started: 2022-06-23 07:54:30 +00:00)

In [17]:
a = pak.drop_multiindex(a, verbose=True)
a

Series mit MultiIndex

    alter    plz  0
0      20  12349  1
1      21  65173  1
2      22  17664  1
3      22  20558  1
4      22  36893  1
..    ...    ... ..
86     41  46514  1
87     41  57346  1
88     41  85024  1
89     41  88487  1
90     42  98053  1

[91 rows x 3 columns]

time: 7.29 ms (started: 2022-06-23 07:54:30 +00:00)

In [18]:
a = pak.drop_multiindex(a, verbose=True)
a

DataFrame ohne MultiIndex

    alter    plz  0
0      20  12349  1
1      21  65173  1
2      22  17664  1
3      22  20558  1
4      22  36893  1
..    ...    ... ..
86     41  46514  1
87     41  57346  1
88     41  85024  1
89     41  88487  1
90     42  98053  1

[91 rows x 3 columns]

time: 7.39 ms (started: 2022-06-23 07:54:30 +00:00)

In [19]:
df['altersklasse'].value_counts()

30    61
20    33
40     6
Name: altersklasse, dtype: Int64

time: 3.34 ms (started: 2022-06-23 07:54:30 +00:00)

In [20]:
df.groupby('altersklasse').count()

              alter  vorname  plz  geburtsstadt  passwort  merkmale  history
altersklasse
20               33       33   31            28        33        33       33
30               61       61   55            44        61        61       61
40                6        6    6             5         6         6        6

time: 8.87 ms (started: 2022-06-23 07:54:30 +00:00)

In [21]:
pak.drop_multiindex(df.groupby('altersklasse').count().unstack())

         level_0  altersklasse   0
0          alter            20  33
1          alter            30  61
2          alter            40   6
3        vorname            20  33
4        vorname            30  61
5        vorname            40   6
6            plz            20  31
7            plz            30  55
8            plz            40   6
9   geburtsstadt            20  28
10  geburtsstadt            30  44
11  geburtsstadt            40   5
12      passwort            20  33
13      passwort            30  61
14      passwort            40   6
15      merkmale            20  33
16      merkmale            30  61
17      merkmale            40   6
18       history            20  33
19       history            30  61
20       history            40   6

time: 8.53 ms (started: 2022-06-23 07:54:30 +00:00)

## Häufigstes Element

In [22]:
# most_freq_elt: Wie Series.mode, aber liefert immer ein Skalar
grouped_altersklasse['alter'].agg( pak.most_freq_elt)

altersklasse
20    27
30    30
40    41
Name: alter, dtype: Int8

time: 4.67 ms (started: 2022-06-23 07:54:30 +00:00)

In [23]:
grouped_altersklasse['alter'].agg( pak.most_freq_elt).to_frame()

              alter
altersklasse
20               27
30               30
40               41

time: 5.91 ms (started: 2022-06-23 07:54:30 +00:00)

In [24]:
#df.groupby(['sex','age'])['bla'].agg(pd.Series.mode)

time: 527 µs (started: 2022-06-23 07:54:30 +00:00)

## agg: Komplexe Aggregation

In [25]:
df

,altersklasse,alter,vorname,plz,geburtsstadt,passwort,merkmale,history
33,20,20,Luise,12349,Bremen,sueZtu9,"{1, K, Z, t}","[A, x]"
23,20,21,Bettina,65173,Bremen,h2gmXdlR,{E},"[c, b, a]"
60,20,22,Detlef,20558,Bremen,InPggz4e,"{i, 0, t}",[]
70,20,22,Helga,17664,Berlin,ÖsVtbINx,"{N, y, 4, G}","[b, b, a, b]"
87,20,22,Helga,36893,<NA>,MRLN8geZJq,"{b, a, 5, g, K}","[A, B, C]"
...,...,...,...,...,...,...,...,...
67,40,41,Eileen,85024,Berlin,n5öBnHn1,{u},"[A, x]"
69,40,41,Lilly,57346,Berlin,JQZÖpr5d,"{n, P, c, m}",[]
74,40,41,Niklas,88487,Berlin,0EZIeX,"{n, F, o, g}","[A, C, C, B]"
17,40,41,Walter,46514,Bremen,eV5äBlKR0L,"{E, l}",[]
50,40,42,Alina,98053,<NA>,lZgmH,{2},"[c, b, a]"

time: 17.1 ms (started: 2022-06-23 07:54:30 +00:00)

In [26]:
gruppiert = df.groupby('altersklasse')

time: 802 µs (started: 2022-06-23 07:54:31 +00:00)

In [27]:
def top_values_2(x): return pak.top_values(x, 2)

time: 747 µs (started: 2022-06-23 07:54:31 +00:00)

In [28]:
ergebnis = gruppiert.agg(
    alter_max           = ('alter',          max ),                          # maximaler Wert
    alter_main          = ('alter',          pak.most_freq_elt),                 # häufigster Wert
    #alter_list          = ('alter',          list),                          # alle Werte   
    alter_set           = ('alter',          set),                           # alle Werte jeweils einmal     
    string_join         = ('vorname',        pak.agg_words),
    string_join_setlike = ('geburtsstadt',   pak.agg_words_nodup),
    listen_join         = ('history',        sum),         
    listen_top3         = ('history',        pak.top_values),                    # top_values liefert die häufigsten Elemente
    listen_top2         = ('history',        top_values_2),                 # top_values hat noch einen Parameter zur Angabe der Anzahl der Elemente                       
    mengen_join         = ('merkmale',       lambda x: set.union(*x)   ),    # siehe https://stackoverflow.com/questions/25020595/row-wise-unions-in-pandas-groupby   
    count               = ('vorname',        'count')                        # die Funktionsname kann auch als String. Alternative: nunique zählt Dups nicht doppelt
    
).reset_index()

grid(ergebnis)

3 Datensätze

time: 51.6 ms (started: 2022-06-23 07:54:31 +00:00)

## group_and_agg

In [29]:
?pak.group_and_agg

time: 48.9 ms (started: 2022-06-23 07:54:31 +00:00)

Signature:
pak.group_and_agg(
    df,
    col_origins,
    col_funcs=None,
    col_names=None,
    dropna=True,
    verbose=None,
)
Docstring:
Gruppiert und aggregiert.
* col_origins: Liste aller columns, die verarbeitet werden sollen
* col_funcs:   Liste aller Funktionen, die darauf angewendet werden sollen.
               Manchmal muss man Strings verwenden, manchmal Funktionsnamen.
               'group' oder '' = Gruppieren.
* col_names:   Liste neuer Namen für die Ergebnisspalten. Optional. Leerzeichen = Standardname wird übernommen.
* dropna:      Parameter für groupby
Beispiel:
group_and_agg(df,
              col_origins=['altersklasse','geburtsstadt', 'vorname',     'alter', 'alter', 'vorname'],
              col_funcs  =['group',       'group',        agg_strings,   'min',   'max',   'min'],
             )
File:      /Data_lab/libs/pandasklar/pandas.py
Type:      function

In [30]:
r = pak.group_and_agg(df, 
              ['altersklasse','geburtsstadt', 'vorname',     'alter','alter', 'vorname'],
              ['group',       '',          pak.agg_words,    'min',  'max',   'min'],
             )

r

,altersklasse,geburtsstadt,vorname_agg_words,alter_min,alter_max,vorname_min
0,20,Berlin,Helga Tim Nikolas Till Alexander Christa Fiona...,22,29,Alexander
1,20,Bremen,Luise Bettina Detlef Claudia Christel Ingrid N...,20,29,Bettina
2,30,Berlin,Torben Zoe Helena Ingrid Maike Barbara Edith S...,30,37,Alina
3,30,Bremen,Eric Finn Hannes Larissa Luise Sylvia Anna Ste...,30,39,Anja
4,40,Berlin,Eileen Lilly Niklas,41,41,Eileen
5,40,Bremen,Eva Walter,40,41,Eva

time: 22.2 ms (started: 2022-06-23 07:54:31 +00:00)

In [31]:
r = pak.group_and_agg(df, 
              ['altersklasse','geburtsstadt', 'vorname',        'alter','alter', 'vorname'],
              ['',            '',           pak.agg_words,      'min',  'max',   'min'    ],
              ['AK',          'GS',           'vornamen_alle',  '',     '',      ''       ],
              dropna=False
             )

r

,AK,GS,vornamen_alle,alter_min,alter_max,vorname_min
0,20,Berlin,Helga Tim Nikolas Till Alexander Christa Fiona...,22,29,Alexander
1,20,Bremen,Luise Bettina Detlef Claudia Christel Ingrid N...,20,29,Bettina
2,20,<NA>,Helga Ingrid Maurice Niklas Alexander,22,28,Alexander
3,30,Berlin,Torben Zoe Helena Ingrid Maike Barbara Edith S...,30,37,Alina
4,30,Bremen,Eric Finn Hannes Larissa Luise Sylvia Anna Ste...,30,39,Anja
5,30,<NA>,Britta Renate Elfriede Finn Tanja Torben David...,30,39,Alexandra
6,40,Berlin,Eileen Lilly Niklas,41,41,Eileen
7,40,Bremen,Eva Walter,40,41,Eva
8,40,<NA>,Alina,42,42,Alina

time: 24.1 ms (started: 2022-06-23 07:54:31 +00:00)

In [32]:
r = pak.group_and_agg(df, ['altersklasse','geburtsstadt'], dropna=False, col_names=['AK','Stadt'] )
r

   AK   Stadt
0  20  Berlin
1  20  Bremen
2  20    <NA>
3  30  Berlin
4  30  Bremen
5  30    <NA>
6  40  Berlin
7  40  Bremen
8  40    <NA>

time: 16.7 ms (started: 2022-06-23 07:54:31 +00:00)

## Group & Filter

In [33]:
df.groupby('vorname').count()

           altersklasse  alter  plz  geburtsstadt  passwort  merkmale  history
vorname
Alexander             2      2    2             1         2         2        2
Alexandra             1      1    1             0         1         1        1
Alina                 2      2    2             1         2         2        2
Anja                  1      1    1             1         1         1        1
Anna                  2      2    1             2         2         2        2
...                 ...    ...  ...           ...       ...       ...      ...
Torsten               1      1    1             1         1         1        1
Uwe                   1      1    1             0         1         1        1
Walter                2      2    2             2         2         2        2
Yannic                1      1    0             1         1         1        1
Zoe                   1      1    1             1         1         1        1

[70 rows x 7 columns]

time: 8.48 ms (started: 2022-06-23 07:54:31 +00:00)

In [34]:
 # alle Datensätze mit Namen, die mehrfach vorkommen
result = df.groupby('vorname').filter(lambda x: len(x) >= 2)
result = result.sort_values('vorname')
grid(result)

56 Datensätze

time: 40.1 ms (started: 2022-06-23 07:54:31 +00:00)

### Mehrfachgruppierung & Filter

In [35]:
# nochmal mit Mehrfachgruppierung
# alle Namen die mehrfach vorkommen und die gleiche Altersklasse haben
df.groupby(['vorname','alter']).filter(lambda x: len(x) >= 2)

,altersklasse,alter,vorname,plz,geburtsstadt,passwort,merkmale,history
70,20,22,Helga,17664,Berlin,ÖsVtbINx,"{N, y, 4, G}","[b, b, a, b]"
87,20,22,Helga,36893,<NA>,MRLN8geZJq,"{b, a, 5, g, K}","[A, B, C]"
12,20,26,Till,86927,Berlin,PUWgG,"{z, G}","[A, A, A]"
75,20,26,Till,59432,Bremen,fx9hRE,"{c, f}","[c, b, a]"
30,30,34,Edith,15947,Berlin,iÜÄqäeo3VA,"{U, V}",[]
84,30,34,Edith,66954,Bremen,0hS4dph0K6,"{P, t, H, m}","[b, b, a, b]"

time: 21.5 ms (started: 2022-06-23 07:54:31 +00:00)

### Das Gleiche stattdessen mit value_counts
* muss noch repariert werden

In [36]:
# Frequencies of each value in the column.
freq = df['vorname'].value_counts()
freq

Till        3
Ingrid      3
Michelle    3
Helga       3
Edith       2
           ..
Nadine      1
Uwe         1
Sophia      1
Eva         1
Eileen      1
Name: vorname, Length: 70, dtype: Int64

time: 3.94 ms (started: 2022-06-23 07:54:31 +00:00)

In [37]:
frequent_values = freq[freq >= 2].index
frequent_values

Index(['Till', 'Ingrid', 'Michelle', 'Helga', 'Edith', 'Alexander', 'Lilly',
       'Niklas', 'Tim', 'Anna', 'Tom', 'Alina', 'Christopher', 'Marianne',
       'Maurice', 'Walter', 'Finn', 'Tanja', 'Steffen', 'Eric', 'Ingeborg',
       'Larissa', 'Torben', 'Maike', 'Stefanie', 'Luise'],
      dtype='string')

time: 2.6 ms (started: 2022-06-23 07:54:31 +00:00)

In [38]:
mask = df['vorname'].isin(frequent_values)
grid(df[mask])

56 Datensätze

time: 33.2 ms (started: 2022-06-23 07:54:31 +00:00)

## Group & Apply

In [39]:
df2 = pd.DataFrame({'A': 'a a b'.split(), 'B': [1,2,3], 'C': [4,6, 5]})

time: 1.15 ms (started: 2022-06-23 07:54:31 +00:00)

In [40]:
g = df2.groupby('A')

time: 925 µs (started: 2022-06-23 07:54:31 +00:00)

In [41]:
# The function passed to apply takes a dataframe as its argument and returns a dataframe. 
# apply combines the result for each group together into a new dataframe:
def gruppenanteil(df):
    return df / df.sum()

g.apply(gruppenanteil)

          B    C
0  0.333333  0.4
1  0.666667  0.6
2  1.000000  1.0

time: 10.5 ms (started: 2022-06-23 07:54:31 +00:00)

In [42]:
# The function passed to apply takes a dataframe as its argument and returns a series. 
# apply combines the result for each group together into a new dataframe:
def gruppendelta(df):
    return df.max() - df.min()

g.apply(gruppendelta)

   B  C
A
a  1  2
b  0  0

time: 10.8 ms (started: 2022-06-23 07:54:31 +00:00)

In [43]:
# The function passed to apply takes a dataframe as its argument and returns a scalar. 
# apply combines the result for each group together into a series, including setting the index as appropriate:
def gruppenspezial(df):
    return df.C.max() - df.B.min()

g.apply(gruppenspezial).to_frame()

   0
A
a  5
b  2

time: 4.16 ms (started: 2022-06-23 07:54:31 +00:00)